# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# YOLO11 小目标增强版 - 减少下采样倍数 + 精细上采样 + 特征对齐优化


# Parameters
nc: 80  # number of classes
scales:  # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11 backbone - 减少下采样损失
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2 (下采样2倍)
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4 (下采样4倍，保留小目标特征，最小可检测2x2像素)
  - [-1, 2, C3k2, [256, False, 0.25]] # 2-P2输出，用于后续小目标检测
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] #4-P3输出
  - [-1, 1, Conv, [512, 3, 2]]  #5-P4/16
  - [-1, 2, C3k2, [512, True]] #6-P4输出
  - [-1, 1, Conv, [1024, 3, 2]]  #7-P5/32
  - [-1, 2, C3k2, [1024, True]] #8
  - [-1, 1, SPPF, [1024, 5]]  #9
  - [-1, 2, C2PSA, [1024]] #10-P5输出

# YOLO11 head - 精细上采样 + 特征对齐
head:
  # 上采样路径：P5→P4→P3→P2，每次上采样后加卷积做特征对齐
  - [-1, 1, nn.Upsample, [None, 2, "bilinear", True]]  # 11 - 双线性上采样，比nearest更精细，边缘更清晰
  - [-1, 1, Conv, [512, 1, 1]]  #12 - 1x1卷积做通道对齐
  - [[-1, 6], 1, Concat, [1]]  #13 - 与P4层特征融合
  - [-1, 2, C3k2, [512, False]] #14
  
  - [-1, 1, nn.Upsample, [None, 2, "bilinear", True]]  #15 - 双线性上采样
  - [-1, 1, Conv, [256, 1, 1]]  #16 - 特征对齐
  - [[-1, 4], 1, Concat, [1]]  #17 - 与P3层特征融合
  - [-1, 2, C3k2, [256, False]] #18
  
  - [-1, 1, nn.Upsample, [None, 2, "bilinear", True]]  #19 - 新增：上采样到P2分辨率(1/4)
  - [-1, 1, Conv, [128, 1, 1]]  #20 - 特征对齐
  - [[-1, 2], 1, Concat, [1]]  #21 - 与P2层特征融合
  - [-1, 2, C3k2, [128, False]] #22 - P2输出，小目标专用检测头
  
  # 下采样路径
  - [-1, 1, Conv, [128, 3, 2]] #23
  - [[-1, 18], 1, Concat, [1]] #24 - 与P3层特征融合
  - [-1, 2, C3k2, [256, False]] #25
  
  - [-1, 1, Conv, [256, 3, 2]] #26
  - [[-1, 14], 1, Concat, [1]] #27 - 与P4层特征融合
  - [-1, 2, C3k2, [512, False]] #28
  
  - [-1, 1, Conv, [512, 3, 2]] #29
  - [[-1, 10], 1, Concat, [1]] #30 - 与P5层特征融合
  - [-1, 2, C3k2, [1024, True]] #31
  
  # 检测头：P2(1/4)、P3(1/8)、P4(1/16) - 专门适配小目标，移除大目标P5头
  - [[22, 25, 28], 1, Detect, [nc]]
